Revit 2027 API
SolidGlass.SolidglassTransmittance Property
 The property labeled "Color" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SolidglassTransmittance { get; }
Public Shared ReadOnly Property SolidglassTransmittance As String
	Get
public:
static property String^ SolidglassTransmittance {
	String^ get ();
}
static member SolidglassTransmittance : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassTransmittanceType".
See Also
Reference
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace